<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"f4d177a9fe9203241b3dacdfeec8735264c5524852a9b693a954f4e8d5c87023","plan_job_ref":"Job Staging Image Build & Push #55 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7440043033","plan_hash":"68dd0afbf6cc747b6c51584ada1564c19d3e6ac27544d72c978a4ee2f6de764c","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 3 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.ASG_config will be updated in-place
!~  resource "aws_autoscaling_group" "ASG_config" {
+       desired_capacity_type            = "units"
        id                               = "fastapi-ASG-dev"
        name                             = "fastapi-ASG-dev"
#        (26 unchanged attributes hidden)

-       tag {
-           key                 = "Name" -> null
-           propagate_at_launch = true -> null
-           value               = "Dev_Environment" -> null
        }

#        (4 unchanged blocks hidden)
    }

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:42" -> (known after apply)
!~      triggers                           = {} -> (known after apply)
#        (14 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:42" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:929fd846f2e35ae91092d5ccd4e64d446a596b6e" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:3bab94a0067fca525f7dd65e7343a451aadeff5f"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
+       network_mode             = (known after apply)
!~      revision                 = 42 -> (known after apply)
-       tags                     = {} -> null
#        (4 unchanged attributes hidden)
    }

  # aws_iam_instance_profile.instance_profile must be replaced
-/+ resource "aws_iam_instance_profile" "instance_profile" {
!~      arn         = "arn:aws:iam::806066816337:instance-profile/InstanceRoleForECS_dev" -> (known after apply)
!~      create_date = "2024-01-07T18:24:21Z" -> (known after apply)
!~      id          = "**********************" -> (known after apply)
!~      name        = "InstanceRoleForECS_dev" -> "InstanceRoleForECS" # forces replacement
+       name_prefix = (known after apply)
-       tags        = {} -> null
!~      unique_id   = "*********************" -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # aws_launch_template.ASG_template will be updated in-place
!~  resource "aws_launch_template" "ASG_template" {
        id                      = "lt-0fb24dbdf35f7cf64"
!~      latest_version          = 3 -> (known after apply)
        name                    = "LaunchTemplateECR20240107162659112500000001"
        tags                    = {}
#        (11 unchanged attributes hidden)

!~      iam_instance_profile {
!~          name = "InstanceRoleForECS_dev" -> "InstanceRoleForECS"
        }

#        (1 unchanged block hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #55](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7440043033)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>